# Taps (package repositories)
tap "espanso/espanso"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "joshmedeski/sesh"
tap "koekeishiya/formulae"
tap "wix/brew"
tap "sst/tap"

# Global configuration for casks
cask_args appdir: "/Applications"

# Development Tools
# CLI Tools for software development
brew "act"
brew "azure-cli"
brew "difftastic"
brew "gh" # github cli use by plenary
brew "git"
brew "git-lfs"
brew "git-filter-repo"
brew "terraform"
brew "lazygit"
brew "lazydocker"
brew "mongosh"


# UI Tools for software development

cask "pgadmin4"
cask "postman"
cask "lm-studio" # LM Studio a better ollama + open-webui in one

# Command Line Utilities
# Enhancements and utilities for better terminal experience
brew "ack"
brew "bat"
brew "binutils"
brew "broot" # a better tree
brew "btop"
brew "coreutils"
brew "diffutils"
brew "direnv"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "ffmpegthumbnailer" #  video thumbnailer requirement yazi
brew "figlet" # ascii fonts similar to toilet but better fonts
brew "findutils"
brew "fzf"
brew "gawk"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-which"
brew "gnupg"
brew "graphviz" # use by PyMC vizuation graph
brew "grep"
brew "gzip"
brew "httpie" # better curl
brew "hyperfine"
brew "jq"
brew "moreutils"
brew "ncdu"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "screen"
brew "slides"
brew "stow"
brew "thefuck"
brew "tldr"
brew "toilet" # ascii art fonts
brew "unar" # opens archieve yazi requirement
brew "wget"
brew "wget"
brew "yarn"
brew "yarn"
brew "yazi"
brew "zlib"
brew "zoxide"
brew "zplug"
brew "zsh"


# Terminal Editors and Emulator
brew "neovim"
brew "starship"
brew "tmux"
brew "vim"
cask "ghostty"



# Programming Languages

# 🐍 Python Development
# Tools specifically for Python programming
brew "pixi" # Faster Pyenv+Poetry/mamba. Conda world  written in Rust
brew "uv" # Faster none conda package manager

# 🕸️ Node Development
brew "node"

# 👽 Golang Development
brew "go"

# 🦀 Rustlang Development
brew "rust"

# 🎀 Gum shell scripting
brew "gum"

# Productivity Applications
# Applications to enhance productivity

cask "1password-cli"
cask "1password"
cask "alt-tab"
cask "chatgpt"
cask "cleanshot"
cask "espanso"
cask "hiddenbar"
cask "obsidian"
cask "raycast"
cask "shortcat" # Vimium C for Applications. Path to Mouseless world

# LLM Development
cask "ollama" # Running Large Language Model Locally
brew "llama.cpp"
brew "poppler" # PDF preview requirement for yazi
brew "portaudio" # Needed of pyaudio
brew "universal-ctags" # Needed for aider
brew "sst/tap/opencode" # Agents on CLI inspired by neovim
# Utilities
# General utilities for everyday use

brew "wireguard-tools"
cask "flux"
cask "lulu"

# Fonts
# Font installations for design and development
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-symbols-only-nerd-font" # yazi requirement

# Browsers
cask "arc"

# Window Management
# Tools for managing application windows
brew "koekeishiya/formulae/skhd" # Simple hotkey daemon for macOS
cask "nikitabobko/tap/aerospace" # inplace of yabai

# Misc Tools
# Miscellaneous tools and utilities
brew "applesimutils"
cask "aldente"
#brew "jstkdng/programs/ueberzugpp" # preview media in terminal yazi requirement
brew "joshmedeski/sesh/sesh" # session manager for tmux

