# Taps (package repositories)
tap "homebrew/cask-fonts"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "wix/brew"
tap "jesseduffield/lazygit"
tap "jesseduffield/lazydocker"

# Global configuration for casks
cask_args appdir: "/Applications"

# Development Tools
# CLI Tools for software development
brew "autoenv"
brew "azure-cli"
brew "git"
brew "git-lfs"
brew "terraform"
brew "lazygit"
brew "lazydocker"


# UI Tools for software development

cask "docker"
cask "pgadmin4"
cask "postman"
cask "visual-studio-code"

# Command Line Utilities
# Enhancements and utilities for better terminal experience
brew "ack"
brew "bat"
brew "bpytop"
brew "binutils"
brew "coreutils"
brew "diffutils"
brew "direnv"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "ffmpegthumbnailer" #  video thumbnailer requirement yazi
brew "findutils"
brew "fzf"
brew "gawk"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-which"
brew "gnupg"
brew "grep"
brew "gzip"
brew "hyperfine"
brew "jq"
brew "moreutils"
brew "ncdu"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "screen"
brew "stow"
brew "thefuck"
brew "tldr"
brew "unar" # opens archieve yazi requirement
brew "wget"
brew "yarn"
brew "zlib"
brew "zplug"
brew "zsh"
brew "zoxide"
brew "wget"
brew "yazi"
brew "yarn"


# Terminal Editors and Emulator
brew "vim"
brew "neovim"
brew "tmux"
brew "starship"
cask "alacritty"




# Programming Languages

# ðŸ Python Development
# Tools specifically for Python programming
brew "pixi" # Faster Pyenv+Poetry/mamba. Conda world  written in Rust
brew "uv" # Faster none conda package manager

# ðŸ•¸ï¸ Node Development
brew "node"

# ðŸ‘½ Golang Development
brew "go"

# ðŸ¦€ Rustlang Development
brew "rust"

# ðŸŽ€ Gum shell scripting
brew "gum"

# Productivity Applications
# Applications to enhance productivity
cask "1password"
cask "alt-tab"
cask "cleanshot"
cask "hiddenbar"
cask "obsidian"
cask "raycast"
cask "chatgpt"


# LLM Development
# brew "llm" # Running LLM as CLI -> installed using rye tools install
brew "ollama" # Running Large Language Model Locally
brew "poppler" # PDF preview requirement for yazi
brew "portaudio" # Needed of pyaudio

# Utilities
# General utilities for everyday use

brew "wireguard-tools"
cask "flux"
cask "kap"
cask "lulu"
cask "syncthing"
cask "the-unarchiver"
cask "transmission"


# Fonts
# Font installations for design and development
cask "font-symbols-only-nerd-font" # yazi requirement
cask "font-hack"
cask "font-hack-nerd-font"

# Browsers
cask "google-chrome"
cask "arc"

# Window Management
# Tools for managing application windows
brew "koekeishiya/formulae/skhd" # Simple hotkey daemon for macOS
brew "koekeishiya/formulae/yabai" # A tiling window manager for macOS


# Misc Tools
# Miscellaneous tools and utilities
brew "applesimutils"
cask "aldente"


# Initialization for yabai and skhd (commented out for manual execution)
# yabai --install-service
# yabai --start-service
# skhd --install-service
# skhd --start-service
